#### 📖 Terraform Plan ('infra/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl
~ custom_domain_verification_id                  = (sensitive value)
      ~ default_hostname                               = "io-p-itn-svc-app-be-fn-01.azurewebsites.net" -> (known after apply)
      + hosting_environment_id                         = (known after apply)
      ~ id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-app-be-fn-01" -> (known after apply)
      ~ key_vault_reference_identity_id                = "SystemAssigned" -> (known after apply)
      ~ kind                                           = "functionapp,linux" -> (known after apply)
      ~ name                                           = "io-p-itn-svc-app-be-fn-01" -> "io-p-itn-svc-app-be-func-01" # forces replacement
      ~ outbound_ip_address_list                       = [
          - "4.232.8.33",
          - "4.232.9.59",
          - "4.232.9.61",
          - "4.232.9.45",
          - "4.232.9.63",
          - "4.232.9.80",
          - "4.232.99.1",
        ] -> (known after apply)
      ~ outbound_ip_addresses                          = "4.232.8.33,4.232.9.59,4.232.9.61,4.232.9.45,4.232.9.63,4.232.9.80,4.232.99.1" -> (known after apply)
      ~ possible_outbound_ip_address_list              = [
          - "4.232.9.126",
          - "4.232.9.127",
          - "4.232.9.205",
          - "4.232.9.206",
          - "4.232.9.90",
          - "4.232.9.91",
          - "4.232.8.208",
          - "4.232.8.254",
          - "4.232.9.117",
          - "4.232.9.32",
          - "4.232.9.34",
          - "4.232.9.49",
          - "4.232.9.51",
          - "4.232.9.4",
          - "4.232.9.113",
          - "4.232.9.192",
          - "4.232.9.194",
          - "4.232.9.56",
          - "4.232.8.33",
          - "4.232.9.59",
          - "4.232.9.61",
          - "4.232.9.45",
          - "4.232.9.63",
          - "4.232.9.80",
          - "4.232.9.126",
          - "4.232.9.127",
          - "4.232.9.205",
          - "4.232.9.206",
          - "4.232.9.90",
          - "4.232.9.91",
          - "4.232.9.83",
          - "4.232.9.85",
          - "4.232.9.87",
          - "4.232.9.121",
          - "4.232.9.123",
          - "4.232.9.89",
          - "4.232.99.1",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses                 = "4.232.9.126,4.232.9.127,4.232.9.205,4.232.9.206,4.232.9.90,4.232.9.91,4.232.8.208,4.232.8.254,4.232.9.117,4.232.9.32,4.232.9.34,4.232.9.49,4.232.9.51,4.232.9.4,4.232.9.113,4.232.9.192,4.232.9.194,4.232.9.56,4.232.8.33,4.232.9.59,4.232.9.61,4.232.9.45,4.232.9.63,4.232.9.80,4.232.9.126,4.232.9.127,4.232.9.205,4.232.9.206,4.232.9.90,4.232.9.91,4.232.9.83,4.232.9.85,4.232.9.87,4.232.9.121,4.232.9.123,4.232.9.89,4.232.99.1" -> (known after apply)
      ~ public_network_access_enabled                  = true -> false
      ~ service_plan_id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-fn-01-plan" -> (known after apply)
      ~ site_credential                                = (sensitive value)
      - storage_account_access_key                     = (sensitive value) -> null
      ~ storage_account_name                           = "iopitnsvcappbefn01st" -> "iopitnsvcappbest01"
      ~ storage_uses_managed_identity                  = false -> true
      ~ tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Enti & Servizi"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
          - "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94" -> null
          - "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5" -> null
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common" -> null
        }
      ~ virtual_network_subnet_id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-svc-app-be-snet-01" -> (known after apply)
      + zip_deploy_file                                = (known after apply)
        # (12 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "e226c784-8f11-48fc-8ffa-d28c05b6d59f" -> (known after apply)
          ~ tenant_id    = "7788edaf-0346-4068-9d79-c868aed15b3d" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ site_config {
          ~ app_scale_limit                         = 0 -> (known after apply)
          + application_insights_connection_string  = (sensitive value)
          - application_insights_key                = (sensitive value) -> null
          ~ default_documents                       = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> (known after apply)
          ~ detailed_error_logging_enabled          = false -> (known after apply)
          ~ elastic_instance_minimum                = 1 -> (known after apply)
          ~ health_check_eviction_time_in_min       = 0 -> 2
          ~ linux_fx_version                        = "NODE|18" -> (known after apply)
          ~ pre_warmed_instance_count               = 1 -> (known after apply)
          + remote_debugging_version                = (known after apply)
          - runtime_scale_monitoring_enabled        = false -> null
          ~ scm_type                                = "None" -> (known after apply)
          ~ worker_count                            = 1 -> (known after apply)
            # (16 unchanged attributes hidden)

          ~ application_stack {
              - use_custom_runtime          = false -> null
                # (2 unchanged attributes hidden)
            }

          - ip_restriction {
              - action                    = "Allow" -> null
              - headers                   = [] -> null
              - name                      = "rule" -> null
              - priority                  = 65000 -> null
              - virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/appbackendl1" -> null
            }
          - ip_restriction {
              - action                    = "Allow" -> null
              - headers                   = [] -> null
              - name                      = "rule" -> null
              - priority                  = 65000 -> null
              - virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/appbackendl2" -> null
            }
          - ip_restriction {
              - action                    = "Allow" -> null
              - headers                   = [] -> null
              - name                      = "rule" -> null
              - priority                  = 65000 -> null
              - virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/appbackendli" -> null
            }
        }

      ~ sticky_settings {
          ~ app_setting_names       = [
                "SLOT_TASK_HUBNAME",
              - "APPINSIGHTS_INSTRUMENTATIONKEY",
            ]
          - connection_string_names = [] -> null
        }
    }

  # module.function_app.module.app_be_fn.azurerm_linux_function_app_slot.this[0] will be created
  + resource "azurerm_linux_function_app_slot" "this" {
      + app_settings                                   = {
          + "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5"
          + "AZURE_SEARCH_ENDPOINT"                           = "https://io-p-itn-svc-srch-01.search.windows.net"
          + "AZURE_SEARCH_INSTITUTIONS_INDEX_NAME"            = "organizations"
          + "AZURE_SEARCH_SERVICES_INDEX_NAME"                = "services"
          + "AZURE_SEARCH_SERVICE_VERSION"                    = "2024-03-01-Preview"
          + "COSMOSDB_CONTAINER_SERVICE_DETAILS"              = "services"
          + "COSMOSDB_NAME"                                   = "app-backend"
          + "COSMOSDB_URI"                                    = "https://io-p-cosmos-services-cms.documents.azure.com:443/"
          + "FEATURED_INSTITUTIONS_FILE_NAME"                 = "featured-institutions.json"
          + "FEATURED_ITEMS_CONTAINER_NAME"                   = "static-content"
          + "FEATURED_SERVICES_FILE_NAME"                     = "featured-services.json"
          + "FETCH_KEEPALIVE_ENABLED"                         = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "40"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          + "FUNCTIONS_WORKER_PROCESS_COUNT"                  = "4"
          + "FUNCTIONS_WORKER_RUNTIME"                        = "node"
          + "NODE_ENV"                                        = "production"
          + "SLOT_TASK_HUBNAME"                               = "StagingTaskHub"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        }
      + builtin_logging_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + function_app_id                                = (known after apply)
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + name                                           = "io-p-itn-svc-app-be-staging-func-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + site_credential                                = (sensitive value)
      + storage_account_name                           = "iopitnsvcappbest01"
      + storage_uses_managed_identity                  = true
      + tags                                           = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = true

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + application_insights_connection_string  = (sensitive value)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/api/v1/info"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version                = "18"
              + use_dotnet_isolated_runtime = false
            }
        }
    }

  # module.function_app.module.app_be_fn.azurerm_monitor_metric_alert.function_app_health_check[0] will be destroyed
  # (because azurerm_monitor_metric_alert.function_app_health_check is not in configuration)
  - resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      - auto_mitigate       = false -> null
      - description         = "Function availability is under threshold level. Runbook: -" -> null
      - enabled             = true -> null
      - frequency           = "PT5M" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Insights/metricAlerts/[io-p-itn-svc-app-be-fn-01] Health Check Failed" -> null
      - name                = "[io-p-itn-svc-app-be-fn-01] Health Check Failed" -> null
      - resource_group_name = "io-p-itn-svc-rg-01" -> null
      - scopes              = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-app-be-fn-01",
        ] -> null
      - severity            = 1 -> null
      - tags                = {} -> null
      - window_size         = "PT5M" -> null

      - criteria {
          - aggregation            = "Average" -> null
          - metric_name            = "HealthCheckStatus" -> null
          - metric_namespace       = "Microsoft.Web/sites" -> null
          - operator               = "LessThan" -> null
          - skip_metric_validation = false -> null
          - threshold              = 50 -> null
        }
    }

  # module.function_app.module.app_be_fn.azurerm_private_endpoint.function_sites will be created
  + resource "azurerm_private_endpoint" "function_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-svc-app-be-func-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-svc-app-be-func-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites",
            ]
        }
    }

  # module.function_app.module.app_be_fn.azurerm_private_endpoint.st_blob will be created
  + resource "azurerm_private_endpoint" "st_blob" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-svc-app-be-blob-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-svc-app-be-blob-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.function_app.module.app_be_fn.azurerm_private_endpoint.st_file will be created
  + resource "azurerm_private_endpoint" "st_file" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-svc-app-be-file-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-svc-app-be-file-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "file",
            ]
        }
    }

  # module.function_app.module.app_be_fn.azurerm_private_endpoint.st_queue will be created
  + resource "azurerm_private_endpoint" "st_queue" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-svc-app-be-queue-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-svc-app-be-queue-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "queue",
            ]
        }
    }

  # module.function_app.module.app_be_fn.azurerm_private_endpoint.staging_function_sites[0] will be created
  + resource "azurerm_private_endpoint" "staging_function_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-svc-app-be-staging-func-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-svc-app-be-staging-func-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites-io-p-itn-svc-app-be-staging-func-01",
            ]
        }
    }

  # module.function_app.module.app_be_fn.azurerm_role_assignment.function_storage_account_contributor will be created
  + resource "azurerm_role_assignment" "function_storage_account_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_app.module.app_be_fn.azurerm_role_assignment.function_storage_blob_data_owner will be created
  + resource "azurerm_role_assignment" "function_storage_blob_data_owner" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_app.module.app_be_fn.azurerm_role_assignment.function_storage_queue_data_contributor will be created
  + resource "azurerm_role_assignment" "function_storage_queue_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_app.module.app_be_fn.azurerm_role_assignment.staging_function_storage_account_contributor[0] will be created
  + resource "azurerm_role_assignment" "staging_function_storage_account_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_app.module.app_be_fn.azurerm_role_assignment.staging_function_storage_blob_data_owner[0] will be created
  + resource "azurerm_role_assignment" "staging_function_storage_blob_data_owner" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_app.module.app_be_fn.azurerm_role_assignment.staging_function_storage_queue_data_contributor[0] will be created
  + resource "azurerm_role_assignment" "staging_function_storage_queue_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_app.module.app_be_fn.azurerm_service_plan.this[0] must be replaced
-/+ resource "azurerm_service_plan" "this" {
      ~ id                           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-fn-01-plan" -> (known after apply)
      ~ kind                         = "linux" -> (known after apply)
      ~ maximum_elastic_worker_count = 2 -> (known after apply)
      ~ name                         = "io-p-itn-svc-app-be-fn-01-plan" -> "io-p-itn-svc-app-be-asp-01" # forces replacement
      ~ reserved                     = true -> (known after apply)
        tags                         = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
      ~ worker_count                 = 3 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.function_app.module.app_be_fn.azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = true
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "italynorth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "iopitnsvcappbest01"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = false
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "io-p-itn-svc-rg-01"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = false
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
    }

  # module.function_app.module.app_be_fn.azurerm_storage_account_network_rules.st_network_rules will be created
  + resource "azurerm_storage_account_network_rules" "st_network_rules" {
      + bypass                     = [
          + "AzureServices",
          + "Logging",
          + "Metrics",
        ]
      + default_action             = "Deny"
      + id                         = (known after apply)
      + ip_rules                   = (known after apply)
      + storage_account_id         = (known after apply)
      + virtual_network_subnet_ids = (known after apply)
    }

  # module.function_app.module.app_be_fn.azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.20.5.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "io-p-itn-svc-app-be-func-snet-01"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "io-p-itn-common-rg-01"
      + virtual_network_name                           = "io-p-itn-common-vnet-01"

      + delegation {
          + name = "default"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.function_app.module.app_be_fn_staging_slot.azurerm_app_service_slot_virtual_network_swift_connection.this[0] will be destroyed
  # (because azurerm_app_service_slot_virtual_network_swift_connection.this is not in configuration)
  - resource "azurerm_app_service_slot_virtual_network_swift_connection" "this" {
      - app_service_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-app-be-fn-01" -> null
      - id             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-app-be-fn-01/slots/staging/config/virtualNetwork" -> null
      - slot_name      = "staging" -> null
      - subnet_id      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-svc-app-be-snet-01" -> null
    }

  # module.function_app.module.app_be_fn_staging_slot.azurerm_linux_function_app_slot.this will be destroyed
  # (because azurerm_linux_function_app_slot.this is not in configuration)
  - resource "azurerm_linux_function_app_slot" "this" {
      - app_settings                                   = {
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5"
          - "AZURE_SEARCH_ENDPOINT"                           = "https://io-p-itn-svc-srch-01.search.windows.net"
          - "AZURE_SEARCH_INSTITUTIONS_INDEX_NAME"            = "organizations"
          - "AZURE_SEARCH_SERVICES_INDEX_NAME"                = "services"
          - "AZURE_SEARCH_SERVICE_VERSION"                    = "2024-03-01-Preview"
          - "COSMOSDB_CONTAINER_SERVICE_DETAILS"              = "services"
          - "COSMOSDB_NAME"                                   = "app-backend"
          - "COSMOSDB_URI"                                    = "https://io-p-cosmos-services-cms.documents.azure.com:443/"
          - "FEATURED_INSTITUTIONS_FILE_NAME"                 = "featured-institutions.json"
          - "FEATURED_ITEMS_CONTAINER_NAME"                   = "static-content"
          - "FEATURED_SERVICES_FILE_NAME"                     = "featured-services.json"
          - "SLOT_TASK_HUBNAME"                               = "StagingTaskHub"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          - "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        } -> null
      - builtin_logging_enabled                        = false -> null
      - client_certificate_enabled                     = false -> null
      - client_certificate_mode                        = "Optional" -> null
      - content_share_force_disabled                   = false -> null
      - custom_domain_verification_id                  = (sensitive value) -> null
      - daily_memory_time_quota                        = 0 -> null
      - default_hostname                               = "io-p-itn-svc-app-be-fn-01-staging.azurewebsites.net" -> null
      - enabled                                        = true -> null
      - ftp_publish_basic_authentication_enabled       = true -> null
      - function_app_id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-app-be-fn-01" -> null
      - functions_extension_version                    = "~4" -> null
      - https_only                                     = true -> null
      - id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-app-be-fn-01/slots/staging" -> null
      - key_vault_reference_identity_id                = "SystemAssigned" -> null
      - kind                                           = "functionapp,linux" -> null
      - name                                           = "staging" -> null
      - outbound_ip_address_list                       = [] -> null
      - possible_outbound_ip_address_list              = [] -> null
      - public_network_access_enabled                  = true -> null
      - site_credential                                = (sensitive value) -> null
      - storage_account_access_key                     = (sensitive value) -> null
      - storage_account_name                           = (sensitive value) -> null
      - storage_uses_managed_identity                  = false -> null
      - tags                                           = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "IO Enti & Servizi"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        } -> null
      - virtual_network_subnet_id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-svc-app-be-snet-01" -> null
      - webdeploy_publish_basic_authentication_enabled = true -> null

      - identity {
          - identity_ids = [] -> null
          - principal_id = "8d06f5dc-c029-4f81-9b5f-d4c6082a05fe" -> null
          - tenant_id    = "7788edaf-0346-4068-9d79-c868aed15b3d" -> null
          - type         = "SystemAssigned" -> null
        }

      - site_config {
          - always_on                               = true -> null
          - app_scale_limit                         = 0 -> null
          - application_insights_key                = (sensitive value) -> null
          - container_registry_use_managed_identity = false -> null
          - default_documents                       = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> null
          - detailed_error_logging_enabled          = false -> null
          - elastic_instance_minimum                = 0 -> null
          - ftps_state                              = "Disabled" -> null
          - health_check_eviction_time_in_min       = 10 -> null
          - health_check_path                       = "/api/v1/info" -> null
          - http2_enabled                           = true -> null
          - ip_restriction_default_action           = "Deny" -> null
          - linux_fx_version                        = "NODE|18" -> null
          - load_balancing_mode                     = "LeastRequests" -> null
          - managed_pipeline_mode                   = "Integrated" -> null
          - minimum_tls_version                     = "1.2" -> null
          - pre_warmed_instance_count               = 1 -> null
          - remote_debugging_enabled                = false -> null
          - runtime_scale_monitoring_enabled        = false -> null
          - scm_ip_restriction_default_action       = "Allow" -> null
          - scm_minimum_tls_version                 = "1.2" -> null
          - scm_type                                = "None" -> null
          - scm_use_main_ip_restriction             = false -> null
          - use_32_bit_worker                       = false -> null
          - vnet_route_all_enabled                  = true -> null
          - websockets_enabled                      = false -> null
          - worker_count                            = 1 -> null

          - application_stack {
              - node_version                = "18" -> null
              - use_custom_runtime          = false -> null
              - use_dotnet_isolated_runtime = false -> null
            }

          - ip_restriction {
              - action                    = "Allow" -> null
              - headers                   = [] -> null
              - name                      = "rule" -> null
              - priority                  = 65000 -> null
              - virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-github-runner-snet" -> null
            }
        }
    }

  # module.networking.module.app_be_snet.azurerm_subnet.this will be destroyed
  # (because azurerm_subnet.this is not in configuration)
  - resource "azurerm_subnet" "this" {
      - address_prefixes                               = [
          - "10.20.5.0/24",
        ] -> null
      - enforce_private_link_endpoint_network_policies = true -> null
      - enforce_private_link_service_network_policies  = false -> null
      - id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-svc-app-be-snet-01" -> null
      - name                                           = "io-p-itn-svc-app-be-snet-01" -> null
      - private_endpoint_network_policies              = "Disabled" -> null
      - private_endpoint_network_policies_enabled      = false -> null
      - private_link_service_network_policies_enabled  = true -> null
      - resource_group_name                            = "io-p-itn-common-rg-01" -> null
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [
          - "Microsoft.Web",
        ] -> null
      - virtual_network_name                           = "io-p-itn-common-vnet-01" -> null

      - delegation {
          - name = "default" -> null

          - service_delegation {
              - actions = [
                  - "Microsoft.Network/virtualNetworks/subnets/action",
                ] -> null
              - name    = "Microsoft.Web/serverFarms" -> null
            }
        }
    }

  # module.networking.module.srch_snet.azurerm_subnet.this will be destroyed
  # (because azurerm_subnet.this is not in configuration)
  - resource "azurerm_subnet" "this" {
      - address_prefixes                               = [
          - "10.20.4.0/26",
        ] -> null
      - enforce_private_link_endpoint_network_policies = true -> null
      - enforce_private_link_service_network_policies  = false -> null
      - id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-svc-srch-snet-01" -> null
      - name                                           = "io-p-itn-svc-srch-snet-01" -> null
      - private_endpoint_network_policies              = "Disabled" -> null
      - private_endpoint_network_policies_enabled      = false -> null
      - private_link_service_network_policies_enabled  = true -> null
      - resource_group_name                            = "io-p-itn-common-rg-01" -> null
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      - virtual_network_name                           = "io-p-itn-common-vnet-01" -> null
    }

  # module.function_app.module.app_be_fn.module.storage_account.azurerm_monitor_metric_alert.storage_account_low_availability[0] will be destroyed
  # (because azurerm_monitor_metric_alert.storage_account_low_availability is not in configuration)
  - resource "azurerm_monitor_metric_alert" "storage_account_low_availability" {
      - auto_mitigate       = false -> null
      - description         = "The average availability is less than 99.8
```

</details>
